# Открываем файл в режиме чтения
f = open('data1.txt', 'r')
print(f)

# Прочитать файл read
s = f.read()
print(s)
print(type(s))

# Открыть файл в бинароном режиме чтения
f = open('data1.txt', 'rb')
s = f.read()
print(s)

# Открыть файл в режиме записи write
f = open('data2.txt', 'w')

# Если файл data2.txt не был создан, он создастся автоматически
# Если он уже был создан, то все данные в нем TODO будут удалены!
f.write('Это новый текст')

# и обязательно закрыть файл!
f.close()

# Открыть файл в режиме добавления информации append
f = open('data2.txt', 'a')
f.write('Это новый текст2')

# Открыть файл в определенной кодировке
f = open('data1.txt', 'r', encoding='utf-8')

# Контекстные менеджеры

# открываем файл c помощью  контекстного менеджера with как f
with open('data1.txt', 'r', encoding='utf-8') as f:

    # строка s равна прочитанному файлу
    s = f.read()

# Далее файл сам закроется, в ручную закрывать не нужно!



