# Синтаксис: lambda [аргументы]: [тело функции]

# Вовзодит число в квадрат
make_square = lambda x: x**2
print(make_square(5))

# Складывает три числа
adder = lambda a, b, c: a + b + c
print(adder(1, 2, 3))


# LAMBDA + FILTER

# Получить четные числа из списка
lst = [1, 2, 3, 4, 5, 6]

# lambda проверяет соответствие аргумента условию, описанному в теле функции
# и присваивает х значение True или False
# lambda x: x % 2 == 0 это функция: «дай мне какое‑то значение, я скажу, чётное оно или нет».
# Для lambda x - это просто имя параметра, который придёт «сверху».
# filter применяет lambda к lst
# filter берёт список lst и по очереди подставляет каждый его элемент в эту функцию как аргумент
# и оставляет только те значения, по которым lambda вернула True
# list преобразовывает полученный результат в формат списка

even_lst = list(filter(lambda x: x % 2 == 0, lst))
print(even_lst)


# LAMBDA + MAP
# Возвести в квадрат каждый элемент списка
lst = [1, 2, 3, 4, 5, 6]

# map берет поочередно элементы списка lst и подает их в lambda
square_lst = list(map(lambda x: x**2, lst))
print(square_lst)


# Преобразование списка различных чисел в список целых чисел
lst = [1.5, 1e-5, 1.23e+1, 5, 1.108]
int_lst = list(map(lambda x:int(x), lst))
print(int_lst)


# УСЛОВИЯ В LAMBDA

# Преобразовать в списке строковые элементы в число
# Остальные элементы оставить без изменений

lst = [1.5, 1e-5, 1.23e+1, 5, 1.108, '100']

# если аргумент x это число, возвращаем его же, если не число, то преобразовываем в число
int_lst = list(map (lambda x: x if isinstance(x, (int, float)) else eval(x), lst))
print(int_lst)


# НЕСКОЛЬКО АРГУМЕНТОВ LAMBDA
lst1 = [1, 2, 3]
lst2 = [3, 2, 1]
result = list(map(lambda x, y: x > y, lst1, lst2))
print(result)


# ФУНКЦИЯ REDUCE B И LAMBDA
# найти произведение всех элеметов списка
# reduce берет первые два, перемножает, запоминает значение,
# берет третий элемент, умножает на запомненное значение, снова запоминает и т.д
lst = [5, 6, 7]

from functools import reduce

product = reduce(lambda x, y: x*y, lst)
print(product)


# СОРТИРОВКА С ПОМОЩЬЮ LAMBDA
# Отсортировать объекты списка по возрасту

class Person:
    name = ''
    age = 0

Mike = Person()
Mike.name = 'Mike'
Mike.age = 15

Joe = Person()
Joe.name = 'Joe'
Joe.age = 20

Mary = Person()
Mary.name = 'Mary'
Mike.age = 13

lst = [Mike, Joe, Mary]

# lamba присваивает key значение age - сортировка будет по возрасту
# Из списка lst бери по очереди элементы x (аргумент лябды),
# а потому у х бери только возраст x.age (функция лямбды, т. е. что делаем с аргументом)
# lambda x: x.age - «Возьми элемент x и верни его age».
# Функция key говорит: «Для каждого элемента возьми вот это значение и сравнивай именно его».

# То есть sort берет объект из списка lst и подает его в лямбду под именем х
# а лямбда возвращает в sort age и sort сортирует по возрасту
lst.sort(key = lambda x: x.age)

for Person in lst:
    print(Person.name)


# Сортировка по второму элементу в списках
lst = [['Andron', 5], ['Ivan', 7], ['Kirill', 3], ['Yan', 1]]

# sort по очереди берет из основного списка вложенные списки и отправляет их в лямбду под именем x
# лямбда их обрабатывает, а именнор берет второй элемент в каждом из списков и возвращает в sort
# Таким образом методу сорт будут переданны все цифры 5, 7, 3, 1 и он их отсортирует по возрастанию
lst.sort(key = lambda x: x[1])

print(lst)


# Задача: получить ключ словаря с максимальным значением
d1 = {'Фон': 10,
      'Пик': 20,
      'Подъем': -3,
      'Спад': 5
      }
# max: идет по элементам словаря d1 и применяет к ним то, что содержится в функции key
# а это может быть другая функция или метод, TODO главное чтобы max могла сделать так: func(x)
# где x - это элемент итерируемого объекта, сначала это 'Фон' - именно ключ (а не вся пара ключ-значение)
# func - это то, что написано в key после = , в нашем случае d1.get, т.е чтобы смогла сделать d1.get(x)
# таким образом при первом прохождении max получит:
# (d1, key = d1.get) -> (d1, d1.get('Фон')) -> 10
# т. е. "Возьми по ключу 'Фон' его значение 10"
# и запомнит, что Фон это 10
# а потом выберет строку которой соответствует максимальное число

a = max(d1, key = d1.get)

# Строку выше можно записать также: a = max(d1, key = lambda x: d1.get(x))

print(a)


# Задача: составить список для каждой точки (1, 2, 3) какому показателю (фон, пик, подъем или спад)
# она соответствует. Показатель - зто ключ словаря который выбирается по максимальньму значению
d = {
    1: {'Фон': 10,
        'Пик': 20,
        'Подъем': -3,
        'Спад': 5
        },

    2: {'Фон': 10,
        'Пик': 20,
        'Подъем': 300,
        'Спад': 5
        },

    3: {'Фон': 10,
        'Пик': 20,
        'Подъем': 300,
        'Спад': 555
        }
}

# map идет по значениям словаря d благодаря записи d.values
# и подает эти значения (другие мини-словари) в лямбду
# лямбда отдает мини словари по очереди функции max
# max применяет к ним функцию x.get / получается d.values.get(x) /
# то есть находит максимальное значение в каждой паре ключ-значение и возвращает ключ,
# значение которого максимально
# list преобразовывает полученные ключи в список

lst = list(map (lambda x: max(x, key = x.get), d.values()))
print(lst)


# Получение всех значений словаря с помощью метода values
a = {1: 'abc', 2: 'def'}
print(list(a.values()))